/** Chinese Sexagenary Cycle 干支纪年 **/

/* 1900年1月31日 庚子年正月初一 */
export const baseDate = new Date(1900, 0, 31);
export const baseDateTime = Date.UTC(baseDate.getFullYear(), baseDate.getMonth(), baseDate.getDate());

/* 日历的开始年份 1900年 */
export const beginYear = 1900;
/* 日历的结束年份 2050年 */
export const endYear = 2050;
/**/
export const LUNAR_MONTH_CN_NAME = [
  ["正月", "端月", "元月", "隅月", "始春", "孟春", "首阳"],
  ["二月", "杏月", "花月", "如月", "仲春", "绀香"],
  ["三月", "桃月", "桐月", "莺时", "阳春", "暮春", "季春"],
  ["四月", "阴月", "梅月", "余月", "清和", "槐序", "孟夏"],
  ["五月", "榴月", "毒月", "蒲月", "仲夏", "天中", "郁蒸"],
  ["六月", "荷月", "荔月", "林钟", "伏月", "溽暑", "季夏"],
  ["七月", "兰月", "巧月", "瓜月", "相月", "孟秋", "首秋"],
  ["八月", "桂月", "壮月", "仲秋", "南宫", "仲商"],
  ["九月", "菊月", "玄月", "季秋", "晚秋", "暮商"],
  ["十月", "良月", "阳月", "子春", "孟冬"],
  ["十一月", "冬月", "葭月", "辜月", "仲冬"],
  ["腊月", "涂月", "嘉平", "季冬", "冰月"]
];

/* 每月的天数 */
export const MONTH_DAYS = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
/* 天干 */
export const HEAVENLY_STEMS = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"];
/* 地支 */
export const EARTHLY_BRANCHES = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"];
/* 生肖 */
export const THE_CHINESE_ZODIAC = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"];
/* 节气 */
export const SOLAR_TERM = [
  "小寒",
  "大寒",
  "立春",
  "雨水",
  "惊蛰",
  "春分",
  "清明",
  "谷雨",
  "立夏",
  "小满",
  "芒种",
  "夏至",
  "小暑",
  "大暑",
  "立秋",
  "处暑",
  "白露",
  "秋分",
  "寒露",
  "霜降",
  "立冬",
  "小雪",
  "大雪",
  "冬至"
];
/**
 * 农历月份 1900-1050年的
 *
 * @example
 * 如 2020年
 * lunarInfo[2020 - 1900]为0x7954 二进制为 111100101010100
 * 从右向左
 * 1-4位: 表示闰月 0x7954 & 0xf = 111100101010100 & 1111 = 4
 * 说明 2020年 润四月
 * 5-16位: 表示农历大小月 从高位到低位依次 1 - 12月 16位是1月 5位是12月
 * 17位 闰月是大月还是小月
 *
 * 00111 1001 0101 0100 => 0111[小大大大] [0[润四月小]] 1001[大小小大] 0101[小大小大] 0100
 *
 */
export const lunarInfo = [
  0x04bd8,
  0x04ae0,
  0x0a570,
  0x054d5,
  0x0d260,
  0x0d950,
  0x16554,
  0x056a0,
  0x09ad0,
  0x055d2,
  0x04ae0,
  0x0a5b6,
  0x0a4d0,
  0x0d250,
  0x1d255,
  0x0b540,
  0x0d6a0,
  0x0ada2,
  0x095b0,
  0x14977,
  0x04970,
  0x0a4b0,
  0x0b4b5,
  0x06a50,
  0x06d40,
  0x1ab54,
  0x02b60,
  0x09570,
  0x052f2,
  0x04970,
  0x06566,
  0x0d4a0,
  0x0ea50,
  0x06e95,
  0x05ad0,
  0x02b60,
  0x186e3,
  0x092e0,
  0x1c8d7,
  0x0c950,
  0x0d4a0,
  0x1d8a6,
  0x0b550,
  0x056a0,
  0x1a5b4,
  0x025d0,
  0x092d0,
  0x0d2b2,
  0x0a950,
  0x0b557,
  0x06ca0,
  0x0b550,
  0x15355,
  0x04da0,
  0x0a5b0,
  0x14573,
  0x052b0,
  0x0a9a8,
  0x0e950,
  0x06aa0,
  0x0aea6,
  0x0ab50,
  0x04b60,
  0x0aae4,
  0x0a570,
  0x05260,
  0x0f263,
  0x0d950,
  0x05b57,
  0x056a0,
  0x096d0,
  0x04dd5,
  0x04ad0,
  0x0a4d0,
  0x0d4d4,
  0x0d250,
  0x0d558,
  0x0b540,
  0x0b6a0,
  0x195a6,
  0x095b0,
  0x049b0,
  0x0a974,
  0x0a4b0,
  0x0b27a,
  0x06a50,
  0x06d40,
  0x0af46,
  0x0ab60,
  0x09570,
  0x04af5,
  0x04970,
  0x064b0,
  0x074a3,
  0x0ea50,
  0x06b58,
  0x055c0,
  0x0ab60,
  0x096d5,
  0x092e0,
  0x0c960,
  0x0d954,
  0x0d4a0,
  0x0da50,
  0x07552,
  0x056a0,
  0x0abb7,
  0x025d0,
  0x092d0,
  0x0cab5,
  0x0a950,
  0x0b4a0,
  0x0baa4,
  0x0ad50,
  0x055d9,
  0x04ba0,
  0x0a5b0,
  0x15176,
  0x052b0,
  0x0a930,
  0x07954,
  0x06aa0,
  0x0ad50,
  0x05b52,
  0x04b60,
  0x0a6e6,
  0x0a4e0,
  0x0d260,
  0x0ea65,
  0x0d530,
  0x05aa0,
  0x076a3,
  0x096d0,
  0x04bd7,
  0x04ad0,
  0x0a4d0,
  0x1d0b6,
  0x0d250,
  0x0d520,
  0x0dd45,
  0x0b5a0,
  0x056d0,
  0x055b2,
  0x049b0,
  0x0a577,
  0x0a4b0,
  0x0aa50,
  0x1b255,
  0x06d20,
  0x0ada0,
  0x14b63
];
